/*
설계
dp
점화식
상태는 윗변을 기준 i
삼각형 + 왼쪽 마름모 + 가운데 마름모 -> 0, 오른쪽 마름모 -> 1
=> 윗변 i, 아랫변 i - 1, i + 1 기준
1) i 위에 삼각형이 있는 경우
 (1) i - 1 이 오른쪽 아래 마름모인 경우
 모두 삼각형, 가운데 마름모, 오른쪽 아래 마름모
 (2) 나머지
 모두 삼각형, 왼쪽 + 가운데 + 오른쪽 마름모
2) i 위에 삼각형이 없는 경우
 (1) i - 1 이 오른쪽 아래 마름모인 경우
 모두 삼각형, 오른쪽 아래 마름모
 (2) 나머지
 모두 삼각형, 왼쪽 + 오른쪽 마름모
 
=> 기준 이전 삼각형에 오른쪽 마름모를 사용했는지 안했는지 -> 2차원.
*/

// [수정] 기존의 2차원 ([n][2]) 배열을 이전 오른쪽 마름모 o/x로 공간 최적화
function solution(n, tops) {
  const mod = 10007;

  // 삼각형 + 왼쪽, (가운데) 마름모
  let prev1 = 2 + tops[0];

  // 오른쪽 마름모
  let prev2 = 1;

  // 0-index
  for (let i = 1; i < n; i++) {
    // 하나로 합치기 위해서 상수 선언
    const top = tops[i];

    const next1 = (prev1 * (2 + top) + prev2 * (1 + top)) % mod;
    const next2 = (prev1 + prev2) % mod;

    prev1 = next1;
    prev2 = next2;
  }

  return (prev1 + prev2) % mod;
}
