/*
설계
dp
점화식
상태는 윗변을 기준 i
삼각형 + 왼쪽 마름모 + 가운데 마름모 -> 0, 오른쪽 마름모 -> 1
=> 윗변 i, 아랫변 i - 1, i + 1 기준
1) i 위에 삼각형이 있는 경우
 (1) i - 1 이 오른쪽 아래 마름모인 경우
 모두 삼각형, 가운데 마름모, 오른쪽 아래 마름모
 (2) 나머지
 모두 삼각형, 왼쪽 + 가운데 + 오른쪽 마름모
2) i 위에 삼각형이 없는 경우
 (1) i - 1 이 오른쪽 아래 마름모인 경우
 모두 삼각형, 오른쪽 아래 마름모
 (2) 나머지
 모두 삼각형, 왼쪽 + 오른쪽 마름모
 
=> 기준 이전 삼각형에 오른쪽 마름모를 사용했는지 안했는지 -> 2차원.
*/

function solution(n, tops) {
    const mod = 10007;
    // 0-index
    const dp = Array.from({length : n}, () => Array(2).fill(0));
    
    // 삼각형 + 왼쪽, (가운데) 마름모
    dp[0][0] = 2 + tops[0];
    
    // 오른쪽 마름모
    dp[0][1] = 1;
    
    for (let i = 1; i < n; i++) {
        // 하나로 합치기 위해서 상수 선언
        const top = tops[i];
        
        dp[i][0] = (dp[i-1][0] * (2 + top) + dp[i-1][1] * (1 + top)) % mod;
        dp[i][1] = (dp[i-1][0] + dp[i-1][1]) % mod
    }
    
    return (dp[n-1][0] + dp[n-1][1]) % mod;
}